#include<bits/stdc++.h>
using namespace std;

int main(){
    
    // Theoretical Question Explanation
    cout << R"(

Theoretical Question Explanation
================================

Question Analysis
-----------------
আমাকে N সাইজের একটি এ্যারে A দেওয়া আছে। আমাকে এই এ্যারের Prefix Sum বের করে এটাকে Reverse Order এ প্রিন্ট করতে হবে।

Observation
-----------
প্রবলেমটি সল্ভ করার জন্য আমাকে যা করতে হবে-
১) প্রথমে N ইনপুট নিয়ে N সাইজের একটি এ্যারে A তৈরি করে এর মানগুলো ইনপুট নিতে হবে।
২) সূত্র অনুযায়ী এর Prefix Sum বের করতে হবে।
৩) For Loop এর মাধ্যমে একে উল্টো করে প্রিন্ট করতে হবে।


Testcase Analysis
-----------------
(১)
স্যাম্পল ইনপুটঃ 
5
2 4 1 5 3
স্যাম্পল আউটপুটঃ
15 12 7 6 2
ব্যাখ্যাঃ
এ্যারেটির Prefix Sum হচ্ছে = 2 6 7 12 15 (একটির সাথে আরেকটি যোগ করে)
এবং একে উল্টো করে প্রিন্ট করলে হবে = 15 12 7 6 2 (যা আমাদের কাঙ্ক্ষিত উত্তর)

(২)
স্যাম্পল ইনপুটঃ 
3
1000000000 1000000000 1000000000
স্যাম্পল আউটপুটঃ
3000000000 2000000000 1000000000
ব্যাখ্যাঃ
এ্যারেটির Prefix Sum হচ্ছে = 1000000000 2000000000 3000000000 (একটির সাথে আরেকটি যোগ করে)
এবং একে উল্টো করে প্রিন্ট করলে হবে = 3000000000 2000000000 1000000000 (যা আমাদের কাঙ্ক্ষিত উত্তর)

)" << endl;

    return 0;
}

// +------------------+
// | alaminonline.com |
// +------------------+
