#include<bits/stdc++.h>
using namespace std;

int main(){
    
    // Theoretical Question Explanation
    cout << R"(

Theoretical Question Explanation
================================

Question Analysis
-----------------
আমাকে একটি Singly Linked List দেওয়া হবে, যার ভেতরে কিছু পূর্ণসংখ্যা (Integer) থাকবে। আমাকে এই লিস্ট থেকে ডুপ্লিকেট ভ্যালুগুলো মুছে ফেলতে হবে এবং সবশেষে ইউনিক ভ্যালুগুলোর লিস্টটি প্রিন্ট করতে হবে।

Observation
-----------
প্রবলেমটি সল্ভ করার জন্য আমাকে যা করতে হবে-
১) লিংক লিস্ট তৈরি করতে হবেঃ
একটি Singly Linked List তৈরি করে -1 না পাওয়া পর্যন্ত ইনপুট নিতে হবে।
২) ডুপ্লিকেট ভ্যালুগুলো মুছতে হবেঃ
Head থেকে শুরু করে NULL না হওয়া পর্যন্ত একটি করে Value নিতে হবে। সেই Value-র সাথে পরবর্তী সকল Value-র তুলনা করতে হবে এবং Duplicate পাওয়া গেলে সেই Value-টা মুছে ফেলতে হবে।
৩) ইউনিক ভ্যালুগুলো প্রিন্ট করতে হবেঃ
ডুপ্লিকেট ভ্যালুগুলো মুছার পর Head থেকে শুরু করে NULL না হওয়া পর্যন্ত প্রতিটা Value প্রিন্ট করতে হবে।

Testcase Analysis
-----------------
(১)
স্যাম্পল ইনপুটঃ 
1 2 3 4 5 -1
স্যাম্পল আউটপুটঃ
1 2 3 4 5
ব্যাখ্যাঃ
এখানে কোনো Duplicate Value নেই। তাই আউটপুট একই রকম এসেছে।

(২)
স্যাম্পল ইনপুটঃ 
1 2 4 2 3 5 1 4 5 2 6 1 -1
স্যাম্পল আউটপুটঃ
1 2 4 3 5 6
ব্যাখ্যাঃ
এখানে Duplicate Value বাদ দিয়ে শুধুমাত্র ইউনিক ভ্যালুগুলো এসেছে।
(যা আমাদের কাঙ্ক্ষিত উত্তর)

(৩)
স্যাম্পল ইনপুটঃ 
5 5 1 1 2 4 2 4 1 3 5 0 -1
স্যাম্পল আউটপুটঃ
5 1 2 4 3 0
ব্যাখ্যাঃ
এখানে Duplicate Value বাদ দিয়ে শুধুমাত্র ইউনিক ভ্যালুগুলো এসেছে।
(যা আমাদের কাঙ্ক্ষিত উত্তর)

(৪)
স্যাম্পল ইনপুটঃ 
10 10 10 20 20 20 10 20 -1
স্যাম্পল আউটপুটঃ
10 20
ব্যাখ্যাঃ
এখানে Duplicate Value বাদ দিয়ে শুধুমাত্র ইউনিক ভ্যালুগুলো এসেছে।
(যা আমাদের কাঙ্ক্ষিত উত্তর)

)" << endl;

    return 0;
}

// +------------------+
// | alaminonline.com |
// +------------------+
